# Data Input and Output
This notebook is the reference code for getting input and output, 
pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:

Python can work with the following file formats:

1.  Comma-separated values (CSV)
2.  XLSX
3.  ZIP
4.  Plain Text (txt)
5.  JSON
6.  XML
7.  HTML
8.  Images
9.  Hierarchical Data Format
10. PDF
11. DOCX
12. MP3
13. MP4
14. SQL

#  https://pandas.pydata.org/docs/user_guide/io.html

# READ CSV , EXCEL , HTML , SQL
conda install sqlalchemy
conda install lxml
conda install html5lib
conda install BeautifulSoup4

In [1]:
# pwd # check current directory
    # All files i have in this directory or it needs to be absolute or reletive path depending file location

In [2]:
import pandas as pd

# CSV

# CSV INPUT

In [13]:
df = pd.read_csv('example') # if type is defined , .format(extension) not required

In [14]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

# CSV OUTPUT

In [4]:
df.to_csv('myfile',index=False) # index=false means we are not required to define indexes as columns in df

pd.read_csv('myfile') # will create a new file named myfile

pandas can read and write excel file , i.e can import the datas but can't import formulas and images or things like macros
(required an extra XLRD library, conda install xlrd)

In [5]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [6]:
df.to_excel('Excel_Sample.xlsx',sheet_name='NewSheet')

# HTML

In [5]:
import ssl
ssl._create_default_https_context = ssl._create_unverified_context
data = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [6]:
data[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
...,...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [7]:
 data[0].head()

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534

# Build a sql engine
It's dependent for specific sql engine with respect to specific library specific

The pandas.io.sql module provides a collection of query wrappers to both facilitate data retrieval and to reduce dependency on DB-specific API. Database abstraction is provided by SQLAlchemy if installed. In addition you will need a driver library for your database. Examples of such drivers are psycopg2 for PostgreSQL or pymysql for MySQL. For SQLite this is included in Python’s standard library by default. You can find an overview of supported drivers for each SQL dialect in the SQLAlchemy docs.


If SQLAlchemy is not installed, a fallback is only provided for sqlite (and for mysql for backwards compatibility, but this is deprecated and will be removed in a future version). This mode requires a Python database adapter which respect the Python DB-API.

See also some cookbook examples for some advanced strategies.

The key functions are:

* read_sql_table(table_name, con[, schema, ...])	
    * Read SQL database table into a DataFrame.
* read_sql_query(sql, con[, index_col, ...])	
    * Read SQL query into a DataFrame.
* read_sql(sql, con[, index_col, ...])	
    * Read SQL query or database table into a DataFrame.
* DataFrame.to_sql(name, con[, flavor, ...])	
    * Write records stored in a DataFrame to a SQL database.

In [8]:
from sqlalchemy import create_engine

In [9]:
engine = create_engine('sqlite:///:memory:')

In [15]:
df.to_sql('data', engine)

4

In [16]:
sql_df = pd.read_sql('data',con=engine)

In [17]:
sql_df

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15